package chapter08;

public class Homework12 {

    /*
    12.说出==和equals的区别(简答)
    result:
    ——————————————————————————————————————————————————————————————————————————————————————
     名称              概念              用于基本数据类型          用于引用类型
    --------------------------------------------------------------------------------------
     ==          判断两者是否相同         可以，判断值是否相等     可以，判断两个对象是否相等
                 比较运算符
    --------------------------------------------------------------------------------------
     equals      判断两者值是否相同             不可以           可以，默认是判断两个对象是否相等，
                 Object类的方法                               但是子类往往重写该方法，用于比较
                 Java类都可以使用equals                        两个对象的属性值是否相等
    ———————————————————————————————————————————————————————————————————————————————————————

     */
}
