package chapter14.homework07;

public class Homework07 {

    /*
    7.试写出Vector和ArrayList的比较?

    ——————————————————————————————————————————————————————————————————————————————————
                底层结构    版本     线程安全(同步)效率       扩容倍数
    ----------------------------------------------------------------------------------
    ArrayList   可变数组    jdk1.2  不安全，效率高         如果使用有参构造器按照1.5倍扩容，
                                                       如果是无参构造器：1、第一次扩容到10
                                                       2、从第二次开始按照1.5倍扩容
    ----------------------------------------------------------------------------------
    Vector      可变数组    jdk1.0  安全，效率不高         如果是无参，默认10，满后，按照2倍
                Object[]                               扩容
                                                       如果是指定大小创建Vector，则每次按
                                                       照2倍扩容
    ——————————————————————————————————————————————————————————————————————————————————
     */
}
